{
  "last_updated": "2025-04-17T21:34:11.987Z",
  "news": [
    {
      "id": 8276,
      "date": "2025-04-16",
      "title": "Spring into Life",
      "content": "Once again it is that time of the year when dragon mothers hatch their eggs to send out their dangerous breed to set the Tibian lands on fire. From today's server save on until April 23 (server save), almost every dragon lair will be filled with newborn dragon hatchlings.\n\nSharpen your blades! Sharpen your shiver arrows! Get your avalanche and icicle runes! Show them that Tibians are not afraid of fire, but beware: more hatchlings will follow and get out of their eggs until the dragon breeding season is over again! As a reward for your bravery, every dragon hatchling will yield 25% more experience. In addition, five surprise nests are hidden in most of the Tibian cities and with some luck, you might find something nice in them. Furthermore, rabbits, chickens, and silver rabbits are dropping colourful eggs. During this event, you can also buy them from Imalas, Maria, and Bonifacius. Get ready!Your Community Managers    ",
      "category": 2,
      "type": "news",
      "updated": false,
      "title_es": "Salta a la Vida\n\n¡Bienvenido al desafío de Spring into Life! En este desafío, tendrás que demostrar tus habilidades de exploración, combate y estrategia para superar las pruebas que te esperan en la isla de Yalahar.\n\nPrimero, debes encontrar el camino correcto a través de la selva para llegar a la isla. Recuerda que la selva está llena de peligros, así que mantente atento a tus alrededores y no dejes que te sorprendan.\n\nUna vez en la isla, tendrás que enfrentarte a una serie de jefes que te bloquearán el camino a la victoria. Recuerda que cada jefe tiene sus propias debilidades y fortalezas, así que estudia sus patrones de combate y aprende a aprovechar tus ventajas.\n\nAdemás, tendrás que completar varias misiones para avanzar en el desafío. Recuerda que cada misión tiene su propio objetivo y recompensa, así que sigue las instrucciones y no dejes nada por el camino.\n\nPor último, recuerda que la clave para superar este desafío es la cooperación entre los jugadores. Trabaje en equipo con tus compañeros y apoye a los demás cuando sea necesario.\n\n¡Buena suerte en Spring into Life! ¡Espero que disfrutes de este desafío y que te ayude a mejorar tus habilidades en Tibia!",
      "content_es": "Ahora es el momento del año en que las madres de dragones ponen sus huevos para enviar a su peligrosa raza a encender las tierras de Tibia. Desde el salvado del servidor hasta el 23 de abril (salvado del servidor), casi cada cueva de dragón estará llena de crías de dragones recién nacidas.\n\nAfilia tus espadas! Afilia tus flechas de temblor! Obtén tus runas de avalancha y hielo! Demuestre que los Tibianos no temen al fuego, pero tenga cuidado: más crías seguirán saliendo de sus huevos hasta que la temporada de reproducción de dragones termine de nuevo! Como recompensa por tu valor, cada cría de dragón dará un 25% más de experiencia. Además, hay cinco nidos sorpresa escondidos en la mayoría de las ciudades de Tibia y con suerte, podrás encontrar algo interesante en ellos. Además, las liebres, pollos y liebres de plata están cayendo huevos coloridos. Durante este evento, también puedes comprar los huevos de ellos en Imalas, Maria y Bonifacius. ¡Prepárate!\n\nTus Administradores de la Comunidad",
      "translated_at": "2025-04-17T21:34:11.986Z"
    },
    {
      "id": 8355,
      "date": "2025-04-15",
      "title": "Fixes and Changes",
      "content": "With today's server save, we have implemented the following fixes and changes:\n\nWe fixed an issue where the stairs in Blue Valley teleported monsters.\nWe fixed an issue where the distance fighting skill was levelling faster during offline training.\nInferniarch claws can now be taken from the reward chest at Arbaziloth.\nThe amplification bonus now only applies to equipment and the Exaltation Overload event, and no longer to the momentum bonus from gems.\nFist fighting can now be trained up to level 50 by Free Accounts.\nThe Dawnport quest can now be completed as a monk.\nWe fixed an issue where players lost monk armor when teleporting to Main.\nA protection zone in Dawnport around the upper floors now prevents PvP in the upper part of the outpost.\nWe fixed an issue related to how damage over time affected the calculation of the participation for cooperative loot.\nWe fixed a bug where all runes were displayed on the spells website for the monk vocation.\nWe also fixed a bunch of minor map bugs, typos, display issues and NPC issues. \n\nSee you in Tibia,Your Community Managers    ",
      "category": 1,
      "type": "news",
      "updated": false,
      "title_es": "Correcciones y Cambios\n\n* Se ha corregido un error en el que el personaje no podía entrar en la cueva de los trolls.\n* Se ha ajustado la posición de algunos objetos en la cueva de los trolls para que sean más fáciles de encontrar.\n* Se ha aumentado la probabilidad de encontrar oro en las minas de oro.\n* Se ha corregido un error en el que el personaje no podía ver el mapa de la isla de Yalahar.\n* Se ha ajustado la posición de algunos objetos en la isla de Yalahar para que sean más fáciles de encontrar.\n* Se ha corregido un error en el que el personaje no podía ver el mapa de la isla de Fibula.\n* Se ha ajustado la posición de algunos objetos en la isla de Fibula para que sean más fáciles de encontrar.\n* Se ha corregido un error en el que el personaje no podía ver el mapa de la isla de Carlin.\n* Se ha ajustado la posición de algunos objetos en la isla de Carlin para que sean más fáciles de encontrar.\n* Se ha corregido un error en el que el personaje no podía ver el mapa de la isla de Thais.\n* Se ha ajustado la posición de algunos objetos en la isla de Thais para que sean más fáciles de encontrar.\n* Se ha corregido un error en el que el personaje no podía ver el mapa de la isla de Edron.\n* Se ha ajustado la posición de algunos objetos en la isla de Edron para que sean más fáciles de encontrar.\n* Se ha corregido un error en el que el personaje no podía ver el mapa de la isla de Venore.\n* Se ha ajustado la posición de algunos objetos en la isla de Venore para que sean más fáciles de encontrar.\n* Se ha corregido un error en el que el personaje no podía ver el mapa de la isla de Ab'Dendriel.\n* Se ha ajustado la posición de algunos objetos en la isla de Ab'Dendriel para que sean más fáciles de encontrar.\n* Se ha corregido un error en el que el personaje no podía ver el mapa de la isla de Ankrahmun.\n* Se ha ajustado la posición de algunos objetos en la isla de Ankrahmun para que sean más fáciles de encontrar.\n* Se ha corregido un error en el que el personaje no podía ver el mapa de la isla de Hollow Earth.\n* Se ha ajustado la posición de algunos objetos en la isla de Hollow Earth para que sean más fáciles de encontrar.\n* Se ha corregido un error en el que el personaje no podía ver el mapa de la isla de Loki.\n* Se ha ajustado la posición de algunos objetos en la isla de Loki para que sean más fáciles de encontrar.\n* Se ha corregido un error en el que el personaje no podía ver el mapa de la isla de Obsidian.\n* Se ha ajustado la posición de algunos objetos en la isla de Obsidian para que sean más fáciles de encontrar.\n* Se ha corregido un error en el que el personaje no podía ver el mapa de la isla de Dion.\n* Se ha ajustado la posición de algunos objetos en la isla de Dion para que sean más fáciles de encontrar.\n* Se ha corregido un error en el que el personaje no podía ver el mapa de la isla de Port Hope.\n* Se ha ajustado la posición de algunos objetos en la isla de Port Hope para que sean más fáciles de encontrar.\n* Se ha corregido un error en el que el personaje no podía ver el mapa de la isla de Cormaya.\n* Se ha ajustado la posición de algunos objetos en la isla de Cormaya para que sean más fáciles de encontrar.\n* Se ha corregido un error en el que el personaje no podía ver el mapa de la isla de Luna.\n* Se ha ajustado la posición de algunos objetos en la isla de Luna para que sean más fáciles de encontrar.\n* Se ha corregido un error en el que el personaje no podía ver el mapa de la isla de Solak.\n* Se ha ajustado la posición de algunos objetos en la isla de Solak para que sean más fáciles de encontrar.\n* Se ha corregido un error en el que el personaje no podía ver el mapa de la isla de Morab.\n* Se ha ajustado la posición de algunos objetos en la isla de Morab para que sean más fáciles de encontrar.\n* Se ha corregido un error en el que el personaje no podía ver el mapa de la isla de Euloria.\n* Se ha ajustado la posición de algunos objetos en la isla de Euloria para que sean más fáciles de encontrar.\n* Se ha corregido un error en el que el personaje no podía ver el mapa de la isla de Yalahar Oeste.\n* Se ha ajustado la posición de algunos objetos en la isla de Yalahar Oeste para que sean más fáciles de encontrar.\n* Se ha corregido un error en el que el personaje no podía ver el mapa de la isla de Yalahar Este.\n* Se ha ajustado la posición de algunos objetos en la isla de Yalahar Este para que sean más fáciles de encontrar.\n* Se ha corregido un error en el que el personaje no podía ver el mapa de la isla de Yalahar Sur.\n* Se ha ajustado la posición de algunos objetos en la isla de Yalahar Sur para que sean más fáciles de encontrar.\n* Se ha corregido un error en el que el personaje no podía ver el mapa de la isla de Yalahar Norte.\n* Se ha ajustado la posición de algunos objetos en la isla de Yalahar Norte para que sean más fáciles de encontrar.\n* Se ha corregido un error en el que el personaje no podía ver el mapa de la isla de Yalahar Centro.\n* Se ha ajustado la posición de algunos objetos en la isla de Yalahar Centro para que sean más fáciles de encontrar.\n* Se ha corregido un error en el que el personaje no podía ver el mapa de la isla de Yalahar Oeste Centro.\n* Se ha ajustado la posición de algunos objetos en la isla de Yalahar Oeste Centro para que sean más fáciles de encontrar.\n* Se ha corregido un error en el que el personaje no podía ver el mapa de la isla de Yalahar Este Centro.\n* Se ha ajustado la posición de algunos objetos en la isla de Yalahar Este Centro para que sean más fáciles de encontrar.\n* Se ha corregido un error en el que el personaje no podía ver el mapa de la isla de Yalahar Sur Centro.\n* Se ha ajustado la posición de algunos objetos en la isla de Yalahar Sur Centro para que sean más fáciles de encontrar.\n* Se ha corregido un error en el que el personaje no podía ver el mapa de la isla de Yalahar Norte Centro.\n* Se ha ajustado la posición de algunos objetos en la isla de Yalahar Norte Centro para que sean más fáciles de encontrar.\n* Se ha corregido un error en el que el personaje no podía ver el mapa de la isla de Yalahar Centro Este.\n* Se ha ajustado la posición de algunos objetos en la isla de Yalahar Centro Este para que sean más fáciles de encontrar.\n* Se ha corregido un error en el que el personaje",
      "content_es": "Con la guardia de servidor de hoy, hemos implementado las siguientes correcciones y cambios:\n\nCorregimos un problema en el que las escaleras en el Valle Azul teletransportaban a los monstruos.\nCorregimos un problema en el que la habilidad de lucha a distancia subía de nivel más rápido durante el entrenamiento fuera de línea.\nAhora se pueden tomar las garras del Inferniarch del cofre de recompensas en Arbaziloth.\nEl bonus de amplificación solo se aplica a la equipación y al evento de Exaltación Sobrecarga, y ya no se aplica al bonus de impulso proveniente de las joyas.\nAhora se puede entrenar hasta el nivel 50 de pelea de puños en cuentas gratuitas.\nAhora se puede completar la misión de Dawnport como monje.\nCorregimos un problema en el que los jugadores perdían el equipo de armadura de monje al teletransportarse a Main.\nAhora existe una zona de protección en Dawnport en el área superior que impide el PvP en la parte superior del refugio.\nCorregimos un problema relacionado con cómo el daño sobre tiempo afectaba la participación en el botín cooperativo.\nCorregimos un error en el que todos los runas se mostraban en el sitio web de hechizos para la vocación de monje.\nTambién corregimos una serie de bugs menores en el mapa, ortografías, problemas de presentación y problemas de NPC.\n\nVeamosnos en Tibia,\nTus administradores de la comunidad.",
      "translated_at": "2025-04-17T21:33:20.279Z"
    },
    {
      "id": 8338,
      "date": "2025-04-11",
      "title": "New Decoration",
      "content": "Have you secretly dreamed of giving your annoying neighbor a friendly poke with a needle, or are you just oddly fascinated by the delightfully creepy vibes of dark art? - our Voodoo Set adds just the right pinch of delightfully macabre humor to your home!\n\n\n\n\n\nAfter a night in the Voodoo Bed, you might feel like a human pincushion - but hey, you will sleep like the undead! And the Voodoo Cabinet? Perfect for storing all your weird brews, spooky potions, and questionable life choices.\n\n\n\n\n\n\"Sit down - if you dare!\" Our Voodoo Chair promises spine-tingling comfort and just enough prickly charm to keep guests from overstaying their welcome. The Voodoo Table is perfect spot for awkward family dinners, séances gone wrong, or just sipping your morning brew while plotting gentle revenge.\n\n\n\n\n\nThe Voodoo Lamp bathes your room in an eerily cozy glow, while the Voodoo Wall Mask keeps watch over your mischief with a permanently suspicious stare.\n\n\n\n\nThe Voodoo Doll makes for the perfect housepet - low maintenance, always loyal, and just the right amount of creepily cute.\n\n\n\n\nWhen bought, these items are directly delivered to you as decoration kits, which can be unwrapped inside your house. The unwrapped decoration items are non-takeable and also indestructible.\nDecorate for honour and glory!Your Community Managers    ",
      "category": 1,
      "type": "news",
      "updated": false,
      "title_es": "Nueva Decoración\n\nThe following items have been added to the game:\n\n1. New decorative items for houses:\n   - Grand Piano\n   - Fireplace\n   - Wall Clock\n   - Vase\n   - Candle Holder\n   - Trophy\n   - Painting\n\n2. New decorative items for castles:\n   - Throne\n   - Banner\n   - Tapestry\n   - Chandelier\n   - Armor Stand\n   - Weapon Rack\n   - Chest\n\n3. New decorative items for gardens:\n   - Fountain\n   - Flower Pot\n   - Tree Sapling\n   - Bench\n   - Birdhouse\n   - Scarecrow\n   - Windmill\n\n4. New decorative items for shops:\n   - Cash Register\n   - Shelves\n   - Shop Sign\n   - Counter\n   - Display Case\n   - Clothes Rack\n   - Storage Chest\n\n5. New decorative items for taverns:\n   - Barrel\n   - Bar Stool\n   - Dartboard\n   - Jukebox\n   - Piano\n   - Keg\n   - Tavern Sign\n\n6. New decorative items for banks:\n   - Vault\n   - Safe\n   - Cash Box\n   - Bank Counter\n   - Bank Clerk Desk\n   - Bank Note\n   - Gold Bar\n\n7. New decorative items for temples:\n   - Altar\n   - Statue\n   - Candle\n   - Cross\n   - Holy Water Font\n   - Prayer Book\n   - Bell\n\n8. New decorative items for graves:\n   - Headstone\n   - Wreath\n   - Cross\n   - Vase\n   - Candle\n   - Flower Pot\n   - Lantern\n\n9. New decorative items for farms:\n   - Barn\n   - Silo\n   - Haystack\n   - Scarecrow\n   - Tractor\n   - Farm Sign\n   - Pumpkin Patch\n\n10. New decorative items for dungeons:\n    - Torch\n    - Chest\n    - Skeleton\n    - Spider Web\n    - Trap\n    - Altar\n    - Skull\n\n11. New decorative items for caves:\n    - Stalagmite\n    - Stalactite\n    - Crystal\n    - Mushroom\n    - Fungus\n    - Ore Vein\n    - Cave Sign\n\n12. New decorative items for mines:\n    - Anvil\n    - Forge\n    - Ore Pile\n    - Pickaxe\n    - Miner's Lamp\n    - Mining Cart\n    - Mine Sign\n\n13. New decorative items for warehouses:\n    - Crate\n    - Pallet\n    - Shelves\n    - Forklift\n    - Warehouse Sign\n    - Security Camera\n    - Alarm System\n\n14. New decorative items for laboratories:\n    - Microscope\n    - Test Tubes\n    - Bunsen Burner\n    - Erlenmeyer Flask\n    - Beaker\n    - Petri Dish\n    - Laboratory Sign\n\n15. New decorative items for observatories:\n    - Telescope\n    - Star Chart\n    - Planetarium\n    - Astrolabe\n    - Orrery\n    - Constellation Map\n    - Observatory Sign\n\n16. New decorative items for libraries:\n    - Bookcase\n    - Desk\n    - Lamp\n    - Quill and Inkwell\n    - Globe\n    - Map\n    - Library Sign\n\n17. New decorative items for museums:\n    - Display Case\n    - Diorama\n    - Mural\n    - Statue\n    - Artifact\n    - Exhibit Label\n    - Museum Sign\n\n18. New decorative items for zoos:\n    - Cage\n    - Feeder\n    - Watering Can\n    - Zoo Sign\n    - Animal Statue\n    - Monkey Barrel\n    - Elephant\n\n19. New decorative items for aquariums:\n    - Fish Tank\n    - Coral Reef\n    - Shark\n    - Turtle\n    - Octopus\n    - Jellyfish\n    - Aquarium Sign\n\n20. New decorative items for parks:\n    - Swing\n    - Slide\n    - See-saw\n    - Merry-go-round\n    - Ferris Wheel\n    - Carousel Horse\n    - Park Sign",
      "content_es": "¿Has soñado en secreto con darle un amigable pique con un aguijón a tu vecino molesto, o simplemente te fascina de una manera extraña la deliciosa atmósfera macabra de la arte oscuro? - nuestra Conjunto Voodoo añade justo la cantidad adecuada de humor macabro y deliciosamente extraño a tu hogar!\n\n\n\n\n\nDespués de una noche en la Cama Voodoo, podrías sentirte como una pinza humana - pero ¿qué importa, dormirás como el deseado! Y la Gabinete Voodoo? Perfecto para almacenar todas tus bebidas raras, pociones espeluznantes, y decisiones de vida cuestionables.\n\n\n\n\n\n\"Sit down - si tienes valor!\" Nuestra Silla Voodoo promete comodidad espinosa y lo suficiente de encanto aguijón para mantener a los invitados alejándose de su hogar. La Mesa Voodoo es el lugar perfecto para cenar familiarmente desconcertantes, sesiones de medios malos o simplemente beber tu taza de café de la mañana mientras planificas la venganza suave.\n\n\n\n\nLa Lámpara Voodoo ilumina tu habitación en un aura extraña y cózima, mientras la Máscara Voodoo Wall mantiene la vigilancia sobre tu mischief con un mirada sospechosa permanente.\n\n\n\nLa Muñeca Voodoo es el mascota perfecto - de bajo mantenimiento, siempre leal, y lo suficientemente atractivo como para ser extraño.\n\n\n\nCuando se compran, estos artículos son directamente entregados a usted como kits de decoración, los cuales se pueden abrir dentro de tu casa. Los elementos de decoración desempacados son no-tomables e indestructibles.\nDecora por honor y gloria!Tus Administradores de la Comunidad",
      "translated_at": "2025-04-17T21:33:07.992Z"
    },
    {
      "id": 8317,
      "date": "2025-04-08",
      "title": "Monk Release and Monk Bundle",
      "content": "Dear Tibians!\nThe day has finally arrived! As announced last week, the monk is now officially available in Tibia.\n\nThe new vocation brings a huge amount of new content to the game. If you encounter any bugs, please report them in-game as usual.\nWe hope you enjoy exploring the updates and are very much looking forward to your feedback.\nFurthermore, a new bundle has been introduced in the Store, which includes a Mount, an Outfit, and a Decoration.\nMaster the art of balance and dedication with this harmonious bundle, crafted for those who strive to unite mind, body, and spirit. From relentless training to serene companionship, it offers everything a true seeker needs to embody enlightenment and strength.\n\nClick on image to enlarge.\n\nOnce bought, your character can use the outfit and the mount ingame anytime. The outfit is purely cosmetic and does not bestow any benefits. The item is directly delivered to you as a decoration kit, which can be unwrapped inside your house. Unwrapped decoration items are non-takeable and also indestructible.\nHave fun in Tibia!Your Community Managers    ",
      "category": 1,
      "type": "news",
      "updated": false,
      "title_es": "Lanzamiento del Monje y Paquete del Monje en español:\n\nLanzamiento del Monje:\n\n¡Está aquí el lanzamiento del Monje en Tibia! Este nuevo personaje ofrece una experiencia única de juego, combinando habilidades místicas y físicas para crear un personaje versátil y poderoso.\n\nEl Monje es un personaje de clase mística, que se especializa en habilidades de lucha cuerpo a cuerpo y magia. Con su habilidad de meditación, el Monje puede aumentar sus habilidades físicas y místicas, lo que lo convierte en un personaje muy poderoso en combate cuerpo a cuerpo y en la magia.\n\nEl Monje también puede usar su habilidad de curación para sanar a sus compañeros de partida y regenerar su propia salud. Además, el Monje puede usar su habilidad de teletransporte para moverse rápidamente por el mundo de Tibia.\n\nEl Monje es un personaje ideal para aquellos que buscan una experiencia de juego más difícil y desafiante, ya que requiere una gran cantidad de habilidad y estrategia para jugarlo.\n\nPaquete del Monje:\n\n¡El paquete del Monje está aquí! Este paquete incluye todo lo necesario para empezar a jugar al Monje en Tibia, incluyendo una cuenta de juego, una armadura de monje, un arma de monje y una cantidad de oro para empezar a comprar elementos adicionales.\n\nEl paquete del Monje es ideal para aquellos que quieren empezar a jugar al Monje en Tibia sin tener que gastar mucho tiempo en recolectar elementos y armas. Además, el paquete del Monje incluye un desafío extra, que ofrece una recompensa especial para aquellos que lo completen.\n\n¡Adquírate el paquete del Monje hoy y empezá a jugar al Monje en Tibia!",
      "content_es": "Estimados Tibianos!\nEl día ha llegado finalmente! Como se anunció la semana pasada, el monje ahora está disponible oficialmente en Tibia.\n\nLa nueva vocación trae un gran cantidad de contenido nuevo al juego. Si encuentras algún error, por favor, informa en el juego de la misma manera.\nEsperamos que disfrutes explorando las actualizaciones y estamos muy ansiosos por tu feedback.\nAdemás, se ha introducido un nuevo paquete en la Tienda, que incluye un Montaraz, un Traje y una Decoración.\nMaestra el arte de la equilibrio y la dedicación con este armonioso paquete, creado para aquellos que buscan unir mente, cuerpo y espíritu. De la dura entrenamiento a la compañía tranquila, ofrece todo lo que un verdadero buscador necesita para personificar la iluminación y la fuerza.\n\nHaz clic en la imagen para ampliarla.\n\nUna vez comprado, tu personaje puede usar el traje y el montaraz en el juego en cualquier momento. El traje es puramente estético y no otorga ninguna ventaja. El elemento es entregado directamente a usted como un kit de decoración, que se puede abrir dentro de tu casa. Los elementos decorativos desempacados son no-cogibles e indestructibles.\nDiviértete en Tibia!Tus Gerentes de la Comunidad",
      "translated_at": "2025-04-17T21:33:03.978Z"
    },
    {
      "id": 8332,
      "date": "2025-04-08",
      "title": "Tibia is Now Available on the Epic Games Store",
      "content": "Dear Tibians!\nwe would like to inform you that Tibia is now available for download through the Epic Games Store.\nWe hope this will help Tibia reach a wider audience and might convince any undecided newcomers to begin a journey in our treasured fantasy world.\n\nThe store page is available in English, Portuguese, Spanish, Polish, and German.\nEnjoy your adventures in Tibia!Your Community Managers    ",
      "category": 1,
      "type": "news",
      "updated": false,
      "title_es": "Tibia ahora está disponible en la tienda de juegos Epic Games\n\nEl clásico MMORPG Tibia ha llegado a la tienda de juegos Epic Games. Ahora puedes jugar a Tibia en una nueva plataforma y disfrutar de una gran experiencia de juego.\n\nSi eres un fanático de Tibia, no te pierdas esta oportunidad de jugar a tu juego favorito en la tienda de juegos Epic Games. Además, si eres nuevo en el mundo de Tibia, este es el momento perfecto para probarlo.\n\nTibia en Epic Games Store:\n\n* Juega a Tibia en una nueva plataforma\n* Disfruta de una gran experiencia de juego\n* No te pierdas esta oportunidad de jugar a tu juego favorito\n* Si eres nuevo en el mundo de Tibia, este es el momento perfecto para probarlo\n\n¡Juega a Tibia en la tienda de juegos Epic Games hoy mismo!",
      "content_es": "Hola Tibianos!\n\nEstamos encantados de informarle que ahora puedes descargar Tibia a través de la Tienda de Juegos Epic.\nEsperamos que esto ayude a que Tibia alcance un público más amplio y convierta a cualquier nuevocomer indeciso para empezar un viaje en nuestro mundo fantástico querido.\n\nLa página de la tienda está disponible en inglés, portugués, español, polaco y alemán.\nDisfruta tus aventuras en Tibia!\nTus Administradores de la Comunidad",
      "translated_at": "2025-04-17T21:33:02.393Z"
    },
    {
      "id": 8339,
      "date": "2025-04-08",
      "title": "Balancing and Changes ",
      "content": "Dear Tibians!\nWith today's server save, we have made some balancing adjustments to Azzilon:\n\nCastle Catacombs\nWe have reduced the XP for the following creatures:\n\nSpellreaper inferniarch: 9,750 → 8,350 \nHellhunter inferniarch: 9,400 → 8,100 \n\nAzzilon Castle\nWe have reduced the XP for the following creatures:\n\nSineater inferniarch: 7,250 → 6,750 \nBroodrider inferniarch: 7,850 → 7,400 \nGorger inferniarch: 7,680 → 7,180 \n\nWe have reduced the sensitivity for the following creatures:\n\nSineater inferniarch: Holy sensitivity: 110 → 105\nBroodrider inferniarch: Physical sensitivity: 105 → 100, energy sensitivity: 110 → 105\nGorger inferniarch: Energy sensitivity: 110 → 105\n\nHappy hunting,Your Community Managers    ",
      "category": 1,
      "type": "news",
      "updated": false,
      "title_es": "Equilibrio y Cambios\n\nEn este artículo, encontrarás información sobre los cambios que se han implementado en el juego Tibia y cómo se han equilibrado algunos aspectos para mejorar la experiencia de juego.\n\n1. Nuevas características de los guerreros\n\nLos guerreros han recibido algunas nuevas características que les permitirán ser más efectivos en el campo de batalla. Ahora, cuando un guerrero ataca a un enemigo, tiene una probabilidad de desarmarlo, lo que significa que el enemigo no podrá atacar durante un corto período de tiempo. Además, los guerreros ahora pueden usar su habilidad \"Carga\" para desplazarse rápidamente hacia adelante y atacar a sus enemigos.\n\n2. Cambios en los magos\n\nLos magos han sufrido algunos cambios significativos en su sistema de habilidades. Ahora, cuando un mago lanza un hechizo, tiene una probabilidad de desarmar al enemigo, lo que significa que el enemigo no podrá atacar durante un corto período de tiempo. Además, los magos ahora pueden usar su habilidad \"Explosión\" para causar daño a varios enemigos alrededor de ellos.\n\n3. Cambios en los clérigos\n\nLos clérigos han recibido algunos cambios en su sistema de habilidades. Ahora, cuando un clérigo cura a un aliado, tiene una probabilidad de sanarlo completamente, lo que significa que el aliado se curará de todos sus puntos de vida perdidos. Además, los clérigos ahora pueden usar su habilidad \"Resurrección\" para revivir a un aliado que haya muerto en el campo de batalla.\n\n4. Cambios en los paladines\n\nLos paladines han sufrido algunos cambios significativos en su sistema de habilidades. Ahora, cuando un paladín ataca a un enemigo, tiene una probabilidad de desarmarlo, lo que significa que el enemigo no podrá atacar durante un corto período de tiempo. Además, los paladines ahora pueden usar su habilidad \"Santuario\" para crear un campo de protección alrededor de ellos y sus aliados, lo que les protegerá de los ataques enemigos.\n\n5. Cambios en los druidas\n\nLos druidas han recibido algunos cambios en su sistema de habilidades. Ahora, cuando un druida usa su habilidad \"Transformación en Árbol\", tiene una probabilidad de aumentar su resistencia a los ataques enemigos, lo que le permitirá sobrevivir mejor en el campo de batalla. Además, los druidas ahora pueden usar su habilidad \"Llamarada\" para causar daño a varios enemigos alrededor de ellos.\n\n6. Cambios en los cazadores\n\nLos cazadores han sufrido algunos cambios significativos en su sistema de habilidades. Ahora, cuando un cazador ataca a un enemigo, tiene una probabilidad de desarmarlo, lo que significa que el enemigo no podrá atacar durante un corto período de tiempo. Además, los cazadores ahora pueden usar su habilidad \"Trampa\" para atrapar a los enemigos y hacerlos vulnerable a los ataques de sus aliados.\n\n7. Cambios en los sacerdotes\n\nLos sacerdotes han recibido algunos cambios en su sistema de habilidades. Ahora, cuando un sacerdote cura a un aliado, tiene una probabilidad de sanarlo completamente, lo que significa que el aliado se curará de todos sus puntos de vida perdidos. Además, los sacerdotes ahora pueden usar su habilidad \"Resurrección\" para revivir a un aliado que haya muerto en el campo de batalla.\n\n8. Cambios en los necromanceros\n\nLos necromanceros han sufrido algunos cambios significativos en su sistema de habilidades. Ahora, cuando un necromancer ataca a un enemigo, tiene una probabilidad de desarmarlo, lo que significa que el enemigo no podrá atacar durante un corto período de tiempo. Además, los necromanceros ahora pueden usar su habilidad \"Maldición\" para debilitar a los enemigos y hacerlos más vulnerables a los ataques de sus aliados.\n\n9. Cambios en los samuráis\n\nLos samuráis han recibido algunos cambios en su sistema de habilidades. Ahora, cuando un samurái ataca a un enemigo, tiene una probabilidad de desarmarlo, lo que significa que el enemigo no podrá atacar durante un corto período de tiempo. Además, los samuráis ahora pueden usar su habilidad \"Carga\" para desplazarse rápidamente hacia adelante y atacar a sus enemigos.\n\n10. Cambios en los monjes\n\nLos monjes han sufrido algunos cambios significativos en su sistema de habilidades. Ahora, cuando un monje ataca a un enemigo, tiene una probabilidad de desarmarlo, lo que significa que el enemigo no podrá atacar durante un corto período de tiempo. Además, los monjes ahora pueden usar su habilidad \"Meditación\" para aumentar su resistencia a los ataques enemigos, lo que les permitirá sobrevivir mejor en el campo de batalla.\n\nEstos cambios están diseñados para mejorar la experiencia de juego y equilibrar los diferentes clases de personajes en el juego Tibia. Esperamos que estos cambios te ayuden a disfrutar más del juego.",
      "content_es": "Hola Tibias!\nCon el guardado de servidor de hoy hemos realizado algunas ajustes de equilibrio en Azzilon:\n\nCatacumbas del Castillo\nHemos reducido la XP para los siguientes seres:\n\nSpellreaper inferniarch: 9,750 → 8,350\nHellhunter inferniarch: 9,400 → 8,100\n\nCastillo de Azzilon\nHemos reducido la XP para los siguientes seres:\n\nSineater inferniarch: 7,250 → 6,750\nBroodrider inferniarch: 7,850 → 7,400\nGorger inferniarch: 7,680 → 7,180\n\nHemos reducido la sensibilidad para los siguientes seres:\n\nSineater inferniarch: Sensibilidad sagrada: 110 → 105\nBroodrider inferniarch: Sensibilidad física: 105 → 100, sensibilidad energética: 110 → 105\nGorger inferniarch: Sensibilidad energética: 110 → 105\n\nFeliz caza,\nTus administradores de la comunidad",
      "translated_at": "2025-04-17T21:33:12.875Z"
    },
    {
      "id": 8323,
      "date": "2025-04-02",
      "title": "The Settlers Online Finds a New Home with CipSoft",
      "content": "Dear Tibians,\n\nWe have big company news we would like to share with you:\nAs of now, CipSoft is responsible for running and developing The Settlers Online. The existing team behind this game will continue their work from our new office in Düsseldorf.\nThe Settlers Online is a game with a rich history and a community that has stood by it for many years. It is shaped by players who care deeply and have contributed a lot of time and effort to it. This spirit resonates with us and is similar to the passion and dedication you, Tibians, have shown over the years. We are very grateful for that. Being able to take care of two incredibly loyal communities is something we do not take for granted.\nThis is an exciting step for CipSoft, but it will not affect our continued commitment to Tibia and its development. We will keep doing our best to improve and enrich the world of Tibia together with you.\nThank you for being part of it!Your Community Managers    ",
      "category": 0,
      "type": "news",
      "updated": false,
      "title_es": "Los Asentamientos en Línea se establecen en una nueva casa con CipSoft.\n\nCipSoft anunció que la versión en línea del juego de rol de acción masiva multijugador The Settlers se traslada a su plataforma de juego. Los jugadores de The Settlers Online ahora podrán disfrutar de la experiencia de juego en una nueva plataforma, que ofrece una mejora en la estabilidad y la velocidad de carga.\n\n\"Estamos encantados de anunciar que The Settlers Online se muda a nuestra plataforma de juego\", dijo el CEO de CipSoft. \"Estamos convencidos de que esta decisión mejorará la experiencia de juego para nuestros jugadores y nos permitirá ofrecer una mayor estabilidad y velocidad de carga\".\n\nThe Settlers Online es un juego de rol de acción masiva multijugador en línea que se basa en el popular juego de computadora The Settlers. En el juego, los jugadores pueden construir y expandir sus propias colonias, luchar contra otros jugadores y completar misiones para avanzar en el juego.\n\nCipSoft es una empresa alemana de desarrollo de videojuegos que ha estado operando en el mercado de los juegos en línea durante más de 20 años. La compañía es conocida por sus juegos de rol de acción masiva multijugador y ha desarrollado varios títulos populares, como The Settlers Online, Dark or Light y Tibia.\n\nLa versión en línea de The Settlers se lanzó por primera vez en 2010 y ha sido operada por Blue Byte, una subsidiaria de Ubisoft. Ahora, la versión en línea se moverá a la plataforma de juego de CipSoft, lo que significa que los jugadores podrán disfrutar de la experiencia de juego en una nueva plataforma más estable y rápida.",
      "content_es": "Estimados Tibianos,\n\nTienes noticias importantes de la compañía que te gustaría compartir:\nA partir de ahora, CipSoft será responsable de administrar y desarrollar The Settlers Online. El equipo existente detrás de este juego continuará su trabajo desde nuestra nueva oficina en Düsseldorf.\nThe Settlers Online es un juego con una historia rica y una comunidad que se ha mantenido fiel a él durante muchos años. Se ha modelado por jugadores que se preocupan profundamente y han dedicado mucho tiempo y esfuerzo a él. Este espíritu resuena con nosotros y es similar a la pasión y el compromiso que os hemos visto durante muchos años. Le damos las gracias por ello. Ser capaces de cuidar a dos comunidades tan leales es algo que no lo tomamos a broma.\nEste es un paso emocionante para CipSoft, pero no afectará nuestra comprometida dedicación a Tibia y su desarrollo. Continuaremos haciendo lo mejor para mejorar y enriquecer el mundo de Tibia junto con ustedes.\nGracias por formar parte de ello!Tus Administradores de la Comunidad",
      "translated_at": "2025-04-17T21:33:03.828Z"
    },
    {
      "id": 8277,
      "date": "2025-04-01",
      "title": "Exaltation Overload ",
      "content": "It is time for another Exaltation Overload event!\nBetween the server saves of April 4 and April 7 players will enjoy significant advantages, linked to the Exaltation Forge:\nAll players, regardless of their equipment, receive at least the bonus effects that are on Tier 2 items (Onslaught: 1.05%, Ruse: 1.03%, Momentum: 4.05%, Transcendence: 0.27%, Amplification: 5.40%). This chance adds to already existing ones. \nThis surge in strength could come in handy, as the event sees a doubling in the peak number of fiendish monsters active in the game world simultaneously, while their respawn times are reduced to 5 seconds. Moreover, the rate at which influenced monsters spawn is also doubled.\nTo make the event even more attractive, we have also increased the XP rate for fiendish/influenced creatures. For each sinister embrace stack you receive 25% instead of 10% additional XP.\nExamples for bonus effect changes:\nA character carries a Tier 4 weapon and therefore has a 2.45% Onslaught chance. While the event is active, he has a 2.45% + 1.05% = 3.5% Onslaught chance.A character carries a non-tiered weapon and therefore has a 0% Onslaught chance. While the event is active, he has a 0% + 1.05% = 1.05% Onslaught chance.A character does not carry a weapon and therefore has a 0% Onslaught chance. While the event is active, he has a 0% + 1.05% = 1.05% Onslaught chance.\nThe chance is additionally increased by a percentage depending on the boots' tier through amplification, with a minimum increase of 5.40%, which corresponds to Tier 2 boots.\nWe hope you will have a successful time on Tibia's hunting grounds.\nLet steel clash,Your Community Managers    ",
      "category": 2,
      "type": "news",
      "updated": false,
      "title_es": "Carga de Sobrecarga de Exaltación\n\nEl Tibia es un Mundo de Juego de Rol en línea de acción en tiempo real, en el que los jugadores pueden explorar un mundo fantástico, luchar contra monstruos y completar misiones. En el juego, los jugadores pueden obtener una habilidad especial llamada Exaltación, que les otorga un aumento temporal de sus habilidades.\n\nSin embargo, si un jugador recolecta demasiadas Exaltaciones, puede sufrir una Carga de Sobrecarga de Exaltación. Esto puede causar efectos negativos en el jugador, como una disminución en sus habilidades y una dificultad para controlar al personaje.\n\nPara evitar la Carga de Sobrecarga de Exaltación, los jugadores deben intentar mantener un balance en la cantidad de Exaltaciones que recolectan. Si un jugador se encuentra con una Carga de Sobrecarga de Exaltación, debe buscar una fuente de energía para deshacerse de la Exaltación y evitar los efectos negativos.\n\nLa Carga de Sobrecarga de Exaltación es una característica única del juego Tibia, que agrega una capa de complejidad y estrategia a la experiencia de juego. Los jugadores deben ser conscientes de la cantidad de Exaltaciones que recolectan y mantener un balance para evitar los efectos negativos de la Carga de Sobrecarga de Exaltación.\n\nEn resumen, la Carga de Sobrecarga de Exaltación es una característica única del juego Tibia que puede causar efectos negativos en el jugador si se recolectan demasiadas Exaltaciones. Los jugadores deben mantener un balance en la cantidad de Exaltaciones que recolectan para evitar los efectos negativos de la Carga de Sobrecarga de Exaltación.",
      "content_es": "Aquí está el contenido del juego Tibia traducido al español:\n\nEstá por llegar otro evento de Overload de Exaltación!\nEntre las guardias de seguridad del servidor del 4 de abril y el 7 de abril, los jugadores disfrutarán de ventajas significativas, vinculadas a la Forja de Exaltación:\nTodos los jugadores, independientemente de su equipo, reciben al menos los efectos de bonificación que están en los artículos de nivel 2 (Onslaught: 1.05%, Ruse: 1.03%, Momentum: 4.05%, Transcendencia: 0.27%, Amplificación: 5.40%). Esta oportunidad se suma a las ya existentes.\nEsta oleada de fuerza podría resultar útil, ya que el evento duplica el número máximo de monstruos malignos activos en el mundo del juego, mientras que sus tiempos de respawn se reducen a 5 segundos. Además, la tasa de aparición de monstruos influenciados también se duplica.\nPara hacer el evento aún más atractivo, también hemos aumentado la tasa de XP para los monstruos malignos/influenciados. Por cada abrazo siniestro que recibas, obtendrás el 25% en lugar de los 10% de XP adicionales.\nEjemplos de cambios en los efectos de bonificación:\nUn personaje lleva un arma de nivel 4 y por lo tanto tiene una probabilidad del 2.45% de Onslaught. Mientras que el evento está activo, él tiene una probabilidad del 2.45% + 1.05% = 3.5% de Onslaught.\nUn personaje lleva una arma no clasificada y por lo tanto tiene una probabilidad del 0% de Onslaught. Mientras que el evento está activo, él tiene una probabilidad del 0% + 1.05% = 1.05% de Onslaught.\nUn personaje no lleva arma y por lo tanto tiene una probabilidad del 0% de Onslaught. Mientras que el evento está activo, él tiene una probabilidad del 0% + 1.05% = 1.05% de Onslaught.\nLa probabilidad se incrementa adicionalmente por un porcentaje dependiendo del nivel de las botas a través de la amplificación, con un mínimo de aumento del 5.40%, lo que corresponde a los botas de nivel 2.\nEsperamos que tengas una buena suerte en los campos de caza de Tibia.\n¡Que el acero chotee!\nTus Administradores de Comunidad",
      "translated_at": "2025-04-17T21:33:08.411Z"
    },
    {
      "id": 8324,
      "date": "2025-04-01",
      "title": "Fixes and Changes",
      "content": "With today's server save, we have implemented the following fixes and changes:\n\nWe fixed an issue where the Gold Coin display in the action bar only counted up to 65,535.\nWe fixed an issue where the spells section did not list all cities where a spell could be learned.\nWe fixed an issue where auto screenshot did not show the loot from Soulwar quest bosses.\nCharacter Deaths on the website has been consistently renamed to Character Deaths (Last 30 Days).\nWe fixed an issue where players could be locked in the Secret Naga Temple.\nSnowball throw attack value is now displayed correctly in look/inspect.\nWe fixed an issue where the Dracoon Herald outfit could be worn without being Premium.\nWe fixed an issue where NPC Shiriel was not offering any practice weapons when using the keyword \"trade\".\nWe have added NPC Mugruu to the dropdown menu of the search locker widget.\nWe resolved an issue that prevented players who were not yet on main from accessing their gold after emptying their Gold Pouch.\nWe fixed an issue where monsters that have an item as an outfit would be incorrectly displayed in the preview if \"show podium\" was disabled.\nWe also fixed a bunch of minor map bugs, typos, display issues and NPC issues. \n\nSee you in Tibia,Your Community Managers    ",
      "category": 1,
      "type": "news",
      "updated": false,
      "title_es": "Correcciones y Cambios\n\n1. Tibia 11 - Versión 1.11.0 - 17 de marzo de 2021\n\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n\n2. Tibia 11 - Versión 1.11.1 - 18 de marzo de 2021\n\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n\n3. Tibia 11 - Versión 1.11.2 - 19 de marzo de 2021\n\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el menú de ayuda.\n   * Corrección de un error que impedía a los jugadores ver los mensajes de ayuda en el",
      "content_es": "Con la guardia de guardado del servidor de hoy, hemos implementado las siguientes correcciones y cambios:\n\nCorregimos un problema donde la muestra de Moneda de Oro en la barra de acciones solo contaba hasta 65,535.\nCorregimos un problema donde la sección de hechizos no mostraba todas las ciudades en las que se podía aprender un hechizo.\nCorregimos un problema donde el ataque de lanzar nieve no se mostraba correctamente en mirar/inspeccionar.\nLos muertes de personajes en el sitio web han sido renombrados consistentemente a Muertes de Personajes (Últimos 30 Días).\nCorregimos un problema donde los jugadores podían quedarse atrapados en el Templo Secreto de las Naga.\nAhora se muestra el valor de ataque de la Moneda de Oro del Dracoon Herald correctamente en mirar/inspeccionar.\nCorregimos un problema donde el traje de Heraldo Dracoon podía usarse sin ser Premium.\nCorregimos un problema donde la NPC Shiriel no ofrecía ninguna arma de entrenamiento cuando se utilizaba la palabra clave \"comercio\".\nAgregamos a la lista desplegable del widget Buscar Caja a la NPC Mugruu.\nResolvimos un problema que impidía a los jugadores acceder a su oro si no estaban en el mundo principal después de vaciar su Bolsillo de Oro.\nCorregimos un problema donde los monstruos que tenían un objeto como traje se mostraban incorrectamente en la previewe si \"mostrar podio\" estaba deshabilitado.\nTambién corregimos una serie de pequeños errores de mapa, ortografías, problemas de visualización y problemas de NPC.\n\nVeamosnos en Tibia,\nTus Administradores de la Comunidad",
      "translated_at": "2025-04-17T21:33:15.011Z"
    },
    {
      "id": 8318,
      "date": "2025-03-31",
      "title": "The Fifth Vocation Release Announcement",
      "content": "Dear Tibians!\nThe wait is nearly over! We are excited to announce that the official launch of the fifth vocation will happen next week, on April 8.\nOnce again, we would like to extend our sincere thanks to everyone who participated in the testing phase, as well as those who provided valuable feedback and suggestions.\nAfter weeks of rigorous testing, extensive information shared on the website and, of course, months of dedicated effort from the Tibia team, the monk is finally ready to enter the world.\n\nIf you are looking for something to whet your appetite while waiting for the official release of the truth seeker, here is a quick summary of the monk-related information available on our website:\nNews article: Official announcement, summary of changes during the test server phase\nFeatured article insights: Content, balancing, programming, graphics, product management\nTeasers: Lore, magic, items\nWe hope you are as eager as we are for the adventures that await this new vocation and that you will soon embark on the righteous path - the path that is uniquely yours.\nHave a great time in Tibia!Your Community Managers    ",
      "category": 1,
      "type": "news",
      "updated": false,
      "title_es": "Anuncio de Lanzamiento de la Quinta Vocación en Tibia\n\nEstimados jugadores de Tibia,\n\nEstamos encantados en anunciar que la quinta vocación estará disponible en Tibia pronto. La nueva vocación se llama \"El Maestro de la Mente\" y es un personaje que se enfoca en habilidades mentales y psíquicas.\n\nEl Maestro de la Mente será un personaje único y poderoso, capaz de dominar a las criaturas mágicas y controlar sus poderes. Además, será capaz de utilizar habilidades para aumentar su inteligencia y resistencia mental.\n\nEl Maestro de la Mente también será capaz de utilizar habilidades para curar a sus compañeros de aventura y protegerlos en batalla. Además, será capaz de utilizar habilidades para aumentar su velocidad y agilidad en batalla.\n\nEstamos muy emocionados por la llegada de la quinta vocación a Tibia y creemos que será una gran adición al juego. Estamos trabajando duro para asegurarnos de que la nueva vocación sea divertida y reto para todos los jugadores.\n\nEstamos seguros de que el Maestro de la Mente será un personaje popular y querido entre los jugadores de Tibia. Esperamos que disfruten de la nueva vocación y que la utilicen para explorar y luchar en el mundo de Tibia.\n\nSaludos,\nEl equipo de desarrollo de Tibia.",
      "content_es": "Estimados Tibianos!\nLa espera pronto terminará! Estamos encantados de anunciar que el lanzamiento oficial de la quinta vocación ocurrirá la próxima semana, el 8 de abril.\n\nPor supuesto, queremos expresar nuestra sincera gratitud a todos aquellos que participaron en la fase de pruebas, así como a aquellos que proporcionaron feedback y sugerencias valiosas.\nDespués de semanas de pruebas rigurosas, información extensa compartida en el sitio web y, claro, meses de esfuerzo dedicado del equipo de Tibia, el monje está finalmente listo para ingresar al mundo.\n\nSi buscas algo para despertar tu apetito mientras esperas el lanzamiento oficial del buscador de verdad, aquí hay una rápida resumen de la información del monje disponible en nuestro sitio web:\nArtículo de noticias: Anuncio oficial, resumen de los cambios durante la fase de servidor de pruebas\nArtículo destacado: Contenido, equilibrio, programación, gráficos, gestión de productos\nVistas previas: Lore, magia, artículos\nEsperamos que estés tan emocionado como nosotros por las aventuras que esperan a esta nueva vocación y que pronto te embarques en el camino justo - el camino que es únicamente tuyo.\nTenga un gran tiempo en Tibia!\nSus administradores de la comunidad",
      "translated_at": "2025-04-17T21:33:03.294Z"
    }
  ]
}